//Напишите программу, которая считает из потока ввода целое число N и определит, чётное оно или нет.
#include <iostream>

using namespace std;

int main(){
  int n;
  cin >> n;
  n % 2 == 0 ? cout << "Число " << n << " чётное" : cout << "Число " << n << " нечётное";
}