//Напишите программу, которая считает целое число N — номер года — и определит, является ли год високосным. Программа должна вывести Да, если год високосный, Нет — если не високосный.
#include <iostream>

using namespace std;

int main(){
  int N;
  cin >> N;
  ((N % 4 == 0 && N % 100 !=0) || (N % 400 ==0)) ? cout << "Да" : cout << "Нет";
}
