//Напишите программу, которая сможет решить линейное уравнение ax + b = 0. Программа должна считать из потока ввода два целых числа a и b и вывести результат: число (корень уравнения) или строку нет корней, бесконечное число корней. --- Программа сложная;
#include <iostream>
using namespace std;

int main() {
    int a, b;
    cin >> a >> b;
    if (a != 0) {
        cout << (static_cast<double>(-b) / a) << endl;
    } else if (b == 0) {
        cout << "бесконечное число корней" << endl;
    } else {
        cout << "нет корней" << endl;
    }
}