  //Напишите программу, которая считает из потока ввода три целых числа — N, M, K — и выведет в поток вывода наименьшее и наибольшее из этих чисел. Ответ нужно вывести в строку через пробел.
  #include <iostream>
    using std::cout;
    using std::cin;

  int main () {
    int N, M, K;
      int min, max;

      // Ввод трех целых чисел
      cin >> N >> M >> K;

      // Нахождение наименьшего числа
      min = N;
      if (M < min) min = M;
      if (K < min) min = K;

      // Нахождение наибольшего числа
      max = N;
      if (M > max) max = M;
      if (K > max) max = K;

      // Вывод результатов в одну строку через пробел
      cout << min << " " << max << std::endl;


  }