//Напишите программу, которая считает из потока ввода целое число N и выведет в поток построчно чётные числа от 0 до N включительно. Воспользуйтесь циклом for и оператором if.
//вводиться число вывести все четные с 0 до этого числа Йо
#include <iostream>
using namespace std;

int main(){

unsigned int N;
cin >> N;

for (int i{}; i <= N; i++){
  if (i%2==0){
    cout << i << endl;
  }
}
}
