# Практическая работа №3

# Задание 1: Сравнить между собой 2 числа
print("Практическая работа №3, Задание 1: Сравнить между собой 2 числа")
try:
    a = float(input("Введите первое число: "))
    b = float(input("Введите второе число: "))
    if a > b:
        print(f"Первое число ({a}) больше второго ({b})")
    elif a < b:
        print(f"Второе число ({b}) больше первого ({a})")
    else:
        print(f"Оба числа равны ({a})")
except ValueError:
    print("Ошибка: введите числовые значения.")

# Задание 2: Определить четность числа
print("\nПрактическая работа №3, Задание 2: Определить четность числа")
try:
    number = int(input("Введите целое число: "))
    if number % 2 == 0:
        print(f"Число {number} является чётным.")
    else:
        print(f"Число {number} является нечётным.")
except ValueError:
    print("Ошибка: введите целое число.")
