/*Участники игры собрались в круг. Они получили номера, начиная с нуля. За каждый ход один из игроков выбывает.*/
#include <iostream>

int main() {
    int count; // Переменная для хранения введенного значения
    //Ввод числа пользователем 
    std::cin >> count;
    // Вывод стихотворения
    std::cout << "Эники, беники ели вареники,\n"
                 "Эники, беники съели вареники,\n"
                 "Эники, беники, хоп!" << std::endl;

    // Вычисление остатка от деления 10 на count и вывод результата
    std::cout<< (10 % count) << std::endl;

    return 0;
}